InformationRegisters/Clouddep_ЗаданияНаРассылку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>Clouddep_ЗаданияНаРассылку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиВЗаданииНаРассылку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПопытки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Письмо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПисьмаДляОтложеннойОтправки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыОтправкиВЗаданииНаРассылку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>СтатусыОтправкиВЗаданииНаРассылку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
					<Comment>В очереди на отправку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Отправлен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУдачнаяОтправка</Name>
					<Comment>Не удачная отправка</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
					<Comment>Отмена</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
					<Comment>Обрабатывается</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПисьмаДляОтложеннойОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>ПисьмаДляОтложеннойОтправки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТекстаПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиВЗаданииНаРассылку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Clouddep_ЗаданияНаРассылку/Forms/ФормаСпискаСОтборомПоПисьму/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьТаблицуПисем();
	СформироватьТаблицуЗаданий(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СписокПоказатьВсе.Пометка = Истина;
	
	СделатьАктивнымПоследнееПисьмо();
	
	Элементы.Список.ОтборСтрок = Новый ФиксированнаяСтруктура("Показывать", Истина);
	ПодключитьОбработчикОжидания("УстановитьОтборПоПисьмуКлиент", 0.4, Истина);
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуПисем()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаданияНаРассылку.Письмо,
		|	СУММА(1) КАК Всего,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаданияНаРассылку.СтатусОтправки <> ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиВЗаданииНаРассылку.ВОбработке)
		|					И ЗаданияНаРассылку.СтатусОтправки <> ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиВЗаданииНаРассылку.Отправлен)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ВРаботе,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаданияНаРассылку.СтатусОтправки = ЗНАЧЕНИЕ(Перечисление.СтатусыОтправкиВЗаданииНаРассылку.Отправлен)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Отправлено
		|ПОМЕСТИТЬ втИтоги
		|ИЗ
		|	РегистрСведений.ЗаданияНаРассылку КАК ЗаданияНаРассылку
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияНаРассылку.Письмо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникПисьмаДляОтложеннойОтправки.Ссылка,
		|	СправочникПисьмаДляОтложеннойОтправки.Наименование,
		|	СправочникПисьмаДляОтложеннойОтправки.Автор,
		|	СправочникПисьмаДляОтложеннойОтправки.ДатаСоздания КАК ДатаСоздания,
		|	СправочникПисьмаДляОтложеннойОтправки.СтатусПисьма,
		|	ЕСТЬNULL(втИтоги.Всего, 0) КАК ПолучателейВсего,
		|	ЕСТЬNULL(втИтоги.ВРаботе, 0) КАК ПолучателейВРаботе,
		|	ЕСТЬNULL(втИтоги.Отправлено, 0) КАК ПолучателейОтправлено
		|ИЗ
		|	Справочник.ПисьмаДляОтложеннойОтправки КАК СправочникПисьмаДляОтложеннойОтправки
		|		ЛЕВОЕ СОЕДИНЕНИЕ втИтоги КАК втИтоги
		|		ПО (втИтоги.Письмо = СправочникПисьмаДляОтложеннойОтправки.Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СправочникПисьмаДляОтложеннойОтправки.Ссылка,
		|	СправочникПисьмаДляОтложеннойОтправки.Наименование,
		|	СправочникПисьмаДляОтложеннойОтправки.Автор,
		|	СправочникПисьмаДляОтложеннойОтправки.ДатаСоздания,
		|	СправочникПисьмаДляОтложеннойОтправки.СтатусПисьма,
		|	ЕСТЬNULL(втИтоги.Всего, 0),
		|	ЕСТЬNULL(втИтоги.ВРаботе, 0),
		|	ЕСТЬNULL(втИтоги.Отправлено, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания";

	Данные = Запрос.Выполнить().Выгрузить();
	Письма.Загрузить(Данные);
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуЗаданий(ПоПисьму=Неопределено)
	Если ПоПисьму=Неопределено Тогда
		Список.Очистить();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоПисьму", ПоПисьму);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрСведенийЗаданияНаРассылку.Письмо,
	|	РегистрСведенийЗаданияНаРассылку.Получатель,
	|	РегистрСведенийЗаданияНаРассылку.АдресПолучателя,
	|	РегистрСведенийЗаданияНаРассылку.ДатаОтправки,
	|	РегистрСведенийЗаданияНаРассылку.СтатусОтправки,
	|	РегистрСведенийЗаданияНаРассылку.Комментарий,
	|	ИСТИНА КАК Показывать,
	|	РегистрСведенийЗаданияНаРассылку.НомерПопытки
	|ИЗ
	|	РегистрСведений.ЗаданияНаРассылку КАК РегистрСведенийЗаданияНаРассылку
	|ГДЕ
	|	РегистрСведенийЗаданияНаРассылку.Письмо = &ПоПисьму";
	Данные = Запрос.Выполнить().Выгрузить();
	Список.Загрузить(Данные);
КонецПроцедуры // ()

&НаКлиенте
Процедура ПисьмаПриАктивизацииСтроки(Элемент)
	УстановитьОтборПоПисьму();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПисьмуКлиент()
	УстановитьОтборПоПисьму();
КонецПроцедуры // УстановитьОтборПоПисьмуКлиент()


&НаСервере
Процедура УстановитьОтборПоПисьму()
	ИдСтроки = Элементы.Письма.ТекущаяСтрока;
	Если ИдСтроки=Неопределено Тогда
		СформироватьТаблицуЗаданий(Неопределено);
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Письма.НайтиПоИдентификатору(ИдСтроки);
	СформироватьТаблицуЗаданий(ДанныеСтроки.Ссылка);
	
	Если Элементы.СписокПоказатьОтправленные.Пометка Тогда
		СтатусОтправлен = Перечисления.СтатусыОтправкиВЗаданииНаРассылку.Отправлен;
		Для каждого СтрокаСписка Из Список Цикл
			Если СтрокаСписка.СтатусОтправки=СтатусОтправлен Тогда
				СтрокаСписка.Показывать = Истина;
			ИНаче
				СтрокаСписка.Показывать = Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Элементы.СписокНеОтправленные.Пометка Тогда
		СтатусОтправлен = Перечисления.СтатусыОтправкиВЗаданииНаРассылку.Отправлен;
		Для каждого СтрокаСписка Из Список Цикл
			Если СтрокаСписка.СтатусОтправки<>СтатусОтправлен Тогда
				СтрокаСписка.Показывать = Истина;
			ИНаче
				СтрокаСписка.Показывать = Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Элементы.СписокПоказатьПроблемные.Пометка Тогда
		СтатусНеУдачнаяОтправка = Перечисления.СтатусыОтправкиВЗаданииНаРассылку.НеУдачнаяОтправка;
		Для каждого СтрокаСписка Из Список Цикл
			Если СтрокаСписка.СтатусОтправки=СтатусНеУдачнаяОтправка Тогда
				СтрокаСписка.Показывать = Истина;
			ИНаче
				СтрокаСписка.Показывать = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого СтрокаСписка Из Список Цикл
			СтрокаСписка.Показывать = Истина;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СделатьАктивнымПоследнееПисьмо()
	КоличествоПисем = Письма.Количество();
	Если КоличествоПисем=0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Письма.Получить(КоличествоПисем-1).ПолучитьИдентификатор();
	Элементы.Письма.ТекущаяСтрока = ИдентификаторСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРассылку(Команда)
	идПисьма = Элементы.Письма.ТекущаяСтрока;
	
	Если идПисьма=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Письма.НайтиПоИдентификатору(идПисьма);
	
	Письмо = ДанныеСтроки.Ссылка;
	
	ОтменитьРассылкуСервер(Письмо);
	
	Элементы.Письма.Обновить();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьРассылкуСервер(Письмо)
	Clouddep_ПочтовыеРассылкиСервер.ОтменитьРассылкуПоПисьму(Письмо);
КонецПроцедуры // ОтменитьРассылкуСервер()



&НаКлиенте
Процедура ПоказатьВсе(Команда)
	Элементы.СписокПоказатьВсе.Пометка = Истина;
	Элементы.СписокПоказатьОтправленные.Пометка = Ложь;
	Элементы.СписокНеОтправленные.Пометка = Ложь;
	Элементы.СписокПоказатьПроблемные.Пометка = Ложь;
	
	УстановитьОтборПоПисьму();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтправленные(Команда)
	Элементы.СписокПоказатьВсе.Пометка = Ложь;
	Элементы.СписокПоказатьОтправленные.Пометка = Истина;
	Элементы.СписокНеОтправленные.Пометка = Ложь;
	Элементы.СписокПоказатьПроблемные.Пометка = Ложь;
	
	УстановитьОтборПоПисьму();
КонецПроцедуры

&НаКлиенте
Процедура НеОтправленные(Команда)
	Элементы.СписокПоказатьВсе.Пометка = Ложь;
	Элементы.СписокПоказатьОтправленные.Пометка = Ложь;
	Элементы.СписокНеОтправленные.Пометка = Истина;
	Элементы.СписокПоказатьПроблемные.Пометка = Ложь;
	
	УстановитьОтборПоПисьму();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПроблемные(Команда)
	Элементы.СписокПоказатьВсе.Пометка = Ложь;
	Элементы.СписокПоказатьОтправленные.Пометка = Ложь;
	Элементы.СписокНеОтправленные.Пометка = Ложь;
	Элементы.СписокПоказатьПроблемные.Пометка = Истина;
	
	УстановитьОтборПоПисьму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПисьма(Команда)
	СформироватьТаблицуПисем();
	СделатьАктивнымПоследнееПисьмо();
	
	ПодключитьОбработчикОжидания("УстановитьОтборПоПисьмуКлиент", 0.4, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	УстановитьОтборПоПисьму();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтправитьПовторноНаСервере(Письмо)
	
	Clouddep_ПочтовыеРассылкиСервер.ЗапуститьРассылкуПовторноПоПисьму(Письмо);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПовторно(Команда)
	
	идПисьма = Элементы.Письма.ТекущаяСтрока;
	
	Если идПисьма=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Письма.НайтиПоИдентификатору(идПисьма);
	
	Письмо = ДанныеСтроки.Ссылка;
	
	ОтправитьПовторноНаСервере(Письмо);
	
	Элементы.Письма.Обновить();
	Элементы.Список.Обновить();
	
КонецПроцедуры
